
import 'package:flutter/material.dart';

import 'data.dart';

List<AboutUsData> aboutUsList = [
  AboutUsData(
      title: 'أولاً التعريف بالتطبيق :-',
      content:
      'تطبيق الورشة الذكية – The Smart Workshop هو تطبيق يعمل علي الهاتف المحمول يقدم خدمات مجانية للفنيين العاملين في مجالات الأبواب والنوافذ والواجهات والشيش حصيرة والمطابخ بمختلف خاماتها الألومنيوم والـU-pvc  والأخشاب المعالجة ( اكريليك – بولي لاك ...... الخ ) ويتيح لهم قناة تواصل مع مصادر توريد الخامات اللازمة لتنفيذ الأعمال .',
      icon: Icons.credit_card,
      color: Colors.green),
  AboutUsData(
      title: 'ثانياً الرؤية والهدف :-',
      content:
      'يهدف التطبيق إلي خلق مجتمع إلكتروني يخدم العاملين في مجال المطابخ والأبواب والنوافذ في العالم العربي والإسلامي يخدم الفني داخل مصنعه بتقديم خدمات تسهل عليه عملية الإدارة والإنتاج وتوفر له  الكثير من الوقت والجهد.',
      icon: Icons.message,
      color: Colors.blue),
  AboutUsData(
      title: 'ثالثاً  الجمهور المستهدف:-',
      content: 'مستهدف من استخدام التطبيق :-' +
          '\n •	كل العاملين فى مجال الأبواب والنوافذ والمطابخ .' +
          '\n •	كل العاملين في مجال الألومنيوم والـU-pvc .' +
          '\n •	كل العاملين في مجال المطابخ الخشبية ( الأكريليك ) .' +
          '\n •	التجار المتخصصين في بيع وتوريد الخامات .' +
          '\n •	المجالات المتعلقة بالمستهدفين مثل ( العاملين فى الزجاج – العاملين في الرخام ... الخ )' +
          '\n •	أصحاب المصانع وشركات السحب .' +
          '\n •	المتخصصين في مجال الاستيراد والتصدير .' +
          '\n •	أصحاب شركات الدهانات وتلوين القطاعات .',
      icon: Icons.account_box,
      color: Colors.pink),
];
